import React, {Component} from 'react';
import {Col, Layout, Row} from "antd"
//paypal images
import paypal1 from '../../../../assets/Wallet/Paypal/paypal1.jpg'


const {Content}=Layout
export default class Bitkub extends Component {
    render() {
        return (
            <Content style={{margin: '24px 16px 0'}}>
                <div className="site-layout-background" style={{padding: 24, minHeight: 360, margin: '24px 16px 0'}}>
                    <Row justify="start">
                        <Col sm={{span: 24}} md={{span: 24}} lg={{span: 24}} xl={{span: 24}}>
                            <h1>Bitkub</h1>
                            <p><b>บิทคอยน์</b> หรือ BTC ถูกจัดประเภทว่าเป็นสกุลเงินดิจิตอล, สินทรัพย์ดิจิตอล และ
                                คริปโตเคอเรนซี บิทคอยน์เป็นช่องทางใหม่ของการโอนเงินผ่านอินเตอร์เน็ตไปทุกที่ในโลกใบนี้
                                การใช้บิทคอยน์ทำให้สามารถส่งเงินจากอย่างไม่มีตัวกลาง
                                กล่าวคือผู้ส่งสามารถส่งตรงไปถึงผู้รับได้เลย โดยไม่ต้องมีองค์กร อย่างธนาคาร หรือ
                                เพย์เมนท์ เกตเวย์มาเป็นตัวกลาง ทำให้การส่งบิทคอยน์เร็วกว่าและถูกกว่า
                                การที่จะเป็นเจ้าของบิทคอยน์ คุณสามารถแลกเงินบาทเป็นบิทคอยน์ได้ที่แพลตฟอร์ม บิทคับ</p>
                            <p><b>Bitkub</b> เป็นเว็บไซด์สำหรับซื้อขาย Bitcoin
                                และเหรียญสกุลเงินดิจิทัลชั้นนำอื่นๆในประเทศไทย ได้อย่างถูกต้องตามกฎหมาย มีใบอนุญาตจาก
                                ก.ล.ต. ไทย เพื่อนๆสามารถสมัครเปิดบัญชีกับ Bitkub
                                เพื่อทำการซื้อขายสกุลเงินดิจิทัลต่างๆด้วยเงินบาทไทยได้
                                โดยสามารถฝากหรือถอนเงินบาทผ่านบัญชีธนาคารในไทยได้ตลอด 24 ชั่วโมง</p>
                            <br/>
                            <h2>1.กดปุ่ม &nbsp;" <a href={"https://www.bitkub.com/signup?ref=236313"} target="_blank"
                                                    rel="noopener noreferrer">สมัครสมาชิกฟรี</a>" โดยคลิกลิงก์<a
                                href={"https://www.bitkub.com/signup?ref=236313"} target="_blank"
                                rel="noopener noreferrer">ที่นี่</a></h2>
                            <h2>วิธีลงทะเบียน **หลังจากยอมรับเงื่อนไขและข้อตกลงของเว็บไซต์**</h2>
                            <ol>
                                <li>ใส่อีเมลของท่าน (ที่ใช้งานได้จริง)</li>
                                <li>ตั้งรหัสผ่านของท่าน</li>
                                <li>ใส่รหัสผ่านอีกครั้ง</li>
                                <li> คลิกปุ่ม “สมัคร BITKUB”</li>
                            </ol>
                            <h3>*ข้อแนะนำ* กรุณาสร้างรหัสผ่านตามคำชี้แนะด้านล่างเพื่อความปลอดภัยของบัญชี</h3>
                            <p>รหัสผ่านต้องมีความยาวอย่างน้อย 8 ตัวอักษร/ตัวเลข</p>
                            <p>รหัสผ่านต้องมีอักษรภาษาอังกฤษตัวใหญ่ (A-Z)</p>
                            <p>รหัสผ่านต้องมีอักษรภาษาอังกฤษตัวเล็ก (a-z)</p>
                            <p>รหัสผ่านต้องมีตัวเลข (0–9)</p>
                            <p>รหัสผ่านต้องมีอักขระพิเศษ (!@#$%^*-_+=)</p>
                        </Col>
                    </Row>
                    <Row justify="start">
                        <Col sm={{span: 24}} md={{span: 24}} lg={{span: 24}} xl={{span: 24}}>
                            <img src={paypal1} alt="paypal1"/>
                        </Col>
                    </Row>
                    <Row justify="start">
                        <Col sm={{span: 24}} md={{span: 24}} lg={{span: 24}} xl={{span: 24}}>
                            <p><b>คลิกเริ่มใช้งาน</b> (เลือกที่ฝั่งซื้อสินค้าด้ย Paypal)</p>
                        </Col>
                    </Row>

                </div>
            </Content>
        )
    }
}